Tekla Open API Reference for Tekla Structures 2025
PointList Methods
The PointList type exposes the following members.
Methods
Name | Description
Add
 Adds a new point to the end of the point list.
AddRange
 Appends all points from another point list to the end of this point list.
Contains
 Checks if the given point is in the list.
GetRange
 Gets a part of the point list.
IndexOf(Point)
 Gets the index of the specified point.
IndexOf(Point, Int32)
 Gets the index of the specified point between the index to start the search from and the end of the list.
IndexOf(Point, Int32, Int32)
 Gets the index of the specified point between the index to start the search from and startIndex + count.
Insert
 Inserts the point to the specified index.
IsEqual
 Compares the current object with an object of the same type.
LastIndexOf(Point)
 Searches for the last occurence of the point in the list.
LastIndexOf(Point, Int32)
 Searches for the last occurence of the point in the list.
LastIndexOf(Point, Int32, Int32)
 Searches for the last occurence of the point in the list.
Remove
 Removes the first occurence of the point from the list.
RemoveRange
 Removes a range of items starting from the given index.
ToArray
 Copies the points to a point array.
Top
See Also
Reference
PointList Class
Tekla.Structures.Drawing Namespace